updated the readme file based on the current architecure
